my_name = 'Макаренко Руслан'

print(f'\tДоброго дня! Меня зовут {my_name}. \n\tЯ аттестованный преподаватель '
      f'Python в Лицее Академии Яндекса.\n'
      f'\tВ прошлом году выпустил своих первых учеников, закончивших двухгодичный курс, который включал в себя'
      f'"Основы программирования" и "Основы промышленного \nпрограммирования".\n\n'
      f'\tВ Академию "Топ" пришел, чтобы прокачать свои навыки программирования, узнать что-то новое и '
      f'погрузиться в фреймворк Flask, а также изучить Django.\n'
      f'Очень надеюсь после прохождения курса поменять профессию и уйти с головой в разработку.\n\n'
      f'\tПомимо дополнительного образования преподаю информатику в 10-11 классах. За спиной имею трёх стобальников '
      f'и более 20 высокобальников по данному предмету.\n\n'
      f'\tЖиву в Краснодаре, в своем доме с женой, двумя детьми, собакой и четырьмя кошками 😂😂😂.')
